Rahix/avr-device/vendor/atmega128rfa1.atdf
      <value-group name="ENUM_BOOTSZ">
        <value caption="Boot Flash size=512 words start address=$FE00" name="512W_FE00" value="0x03"/>
        <value caption="Boot Flash size=1024 words start address=$FC00" name="1024W_FC00" value="0x02"/>
        <value caption="Boot Flash size=2048 words start address=$F800" name="2048W_F800" value="0x01"/>
        <value caption="Boot Flash size=4096 words start address=$F000" name="4096W_F000" value="0x00"/>
      </value-group>
      <value-group name="ENUM_BODLEVEL">
        <value caption="Brown-out detection disabled" name="DISABLED" value="0x07"/>
        <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
        <value caption="Brown-out detection at VCC=1.9 V" name="1V9" value="0x05"/>
        <value caption="Brown-out detection at VCC=2.0 V" name="2V0" value="0x04"/>
        <value caption="Brown-out detection at VCC=2.1 V" name="2V1" value="0x03"/>
        <value caption="Brown-out detection at VCC=2.2 V" name="2V2" value="0x02"/>
        <value caption="Brown-out detection at VCC=2.3 V" name="2V3" value="0x01"/>
        <value caption="Brown-out detection at VCC=2.4 V" name="2V4" value="0x00"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
        </register>
      </register-group>
      <value-group name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group name="ENUM_BLB">
        <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group name="ENUM_BLB2">
        <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
        </register>
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
          <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART0">
        <register caption="USART0 I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART0 Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
          <bitfield caption="Frame Error" mask="0x10" name="FE0"/>
          <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
          <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
        </register>
        <register caption="USART0 Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
        </register>
        <register caption="USART0 Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL0" values="COMM_USART_MODE_2BIT_MEGARF"/>
          <bitfield caption="Parity Mode" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ0" values="USART_CHAR_SIZE_BITF"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0" values="USART_CLK_POLARITY_BITF"/>
        </register>
        <register caption="USART0 Baud Rate Register  Bytes" name="UBRR0" offset="0xC4" size="2" mask="0xFFFF"/>
      </register-group>
      <register-group caption="USART" name="USART1">
        <register caption="USART1 I/O Data Register" name="UDR1" offset="0xCE" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART1 Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
          <bitfield caption="Frame Error" mask="0x10" name="FE1"/>
          <bitfield caption="Data OverRun" mask="0x08" name="DOR1"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE1"/>
          <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X1"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
        </register>
        <register caption="USART1 Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
        </register>
        <register caption="USART1 Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT_MEGARF"/>
          <bitfield caption="Parity Mode" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1" values="USART_CHAR_SIZE_BITF"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1" values="USART_CLK_POLARITY_BITF"/>
        </register>
        <register caption="USART1 Baud Rate Register  Bytes" name="UBRR1" offset="0xCC" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group name="COMM_USART_MODE_2BIT_MEGARF">
        <value caption="Asynchronous USART" name="ASYNCHRONOUS_USART" value="0x00"/>
        <value caption="Synchronous USART" name="SYNCHRONOUS_USART" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Master SPI (MSPIM)" name="MASTER_SPI_MSPIM" value="0x03"/>
      </value-group>
      <value-group name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="DISABLED" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Enabled, Even Parity" name="ENABLED_EVEN_PARITY" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="ENABLED_ODD_PARITY" value="0x03"/>
      </value-group>
      <value-group name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="1_BIT" value="0x00"/>
        <value caption="2-bit" name="2_BIT" value="0x01"/>
      </value-group>
      <value-group name="USART_CHAR_SIZE_BITF">
        <value caption="5-bit" name="5_BIT" value="0"/>
        <value caption="6-bit" name="6_BIT" value="1"/>
        <value caption="7-bit" name="7_BIT" value="2"/>
        <value caption="8-bit" name="8_BIT" value="3"/>
        <value caption="Reserved" name="RESERVED" value="4"/>
        <value caption="Reserved" name="RESERVED" value="5"/>
        <value caption="Reserved" name="RESERVED" value="6"/>
        <value caption="9-bit" name="9_BIT" value="7"/>
      </value-group>
      <value-group name="USART_CLK_POLARITY_BITF">
        <value caption="Rising XCKn Edge (Transmitted Data Changed), Falling XCKn Edge (Received Data Sampled)" name="RISING_XCKN_EDGE_TRANSMITTED_DATA_CHANGED_FALLING_XCKN_EDGE_RECEIVED_DATA_SAMPLED" value="0"/>
        <value caption="Falling XCKn Edge (Transmitted Data Changed), Rising XCKn Edge (Received Data Sampled)" name="FALLING_XCKN_EDGE_TRANSMITTED_DATA_CHANGED_RISING_XCKN_EDGE_RECEIVED_DATA_SAMPLED" value="1"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
          <bitfield caption="TWI Address Mask" mask="0xFE" name="TWAM"/>
          <bitfield caption="Reserved Bit" mask="0x01" name="Res"/>
        </register>
        <register caption="TWI Bit Rate Register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI START Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI STOP Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collision Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="Reserved Bit" mask="0x02" name="Res"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" values="TWI_STATUS_BITF" lsb="3"/>
          <bitfield caption="Reserved Bit" mask="0x04" name="Res"/>
          <bitfield caption="TWI Prescaler Bits" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data Register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address Register" name="TWAR" offset="0xBA" size="1">
          <bitfield caption="TWI (Slave) Address" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group name="TWI_STATUS_BITF">
        <value caption="Bus error due to illegal START or STOP condition." name="BUS_ERROR_DUE_TO_ILLEGAL_START_OR_STOP_CONDITION" value="0x00"/>
        <value caption="A START condition has been transmitted." name="A_START_CONDITION_HAS_BEEN_TRANSMITTED" value="0x08"/>
        <value caption="A repeated START condition has been transmitted." name="A_REPEATED_START_CONDITION_HAS_BEEN_TRANSMITTED" value="0x10"/>
        <value caption="SLA+W has been transmitted; ACK has been received." name="SLA_W_HAS_BEEN_TRANSMITTED_ACK_HAS_BEEN_RECEIVED" value="0x18"/>
        <value caption="SLA+W has been transmitted; NOT ACK has been received." name="SLA_W_HAS_BEEN_TRANSMITTED_NOT_ACK_HAS_BEEN_RECEIVED" value="0x20"/>
        <value caption="Data byte has been transmitted; ACK has been received." name="DATA_BYTE_HAS_BEEN_TRANSMITTED_ACK_HAS_BEEN_RECEIVED" value="0x28"/>
        <value caption="Data byte has been transmitted; NOT ACK has been received." name="DATA_BYTE_HAS_BEEN_TRANSMITTED_NOT_ACK_HAS_BEEN_RECEIVED" value="0x30"/>
        <value caption="Arbitration lost in SLA+W or data bytes (Transmitter); Arbitration lost in SLA+R or NOT ACK bit (Receiver)." name="ARBITRATION_LOST_IN_SLA_W_OR_DATA_BYTES_TRANSMITTER_ARBITRATION_LOST_IN_SLA_R_OR_NOT_ACK_BIT_RECEIVER" value="0x38"/>
        <value caption="SLA+R has been transmitted; ACK has been received." name="SLA_R_HAS_BEEN_TRANSMITTED_ACK_HAS_BEEN_RECEIVED" value="0x40"/>
        <value caption="SLA+R has been transmitted; NOT ACK has been received." name="SLA_R_HAS_BEEN_TRANSMITTED_NOT_ACK_HAS_BEEN_RECEIVED" value="0x48"/>
        <value caption="Data byte has been received; ACK has been returned." name="DATA_BYTE_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x50"/>
        <value caption="Data byte has been received; NOT ACK has been returned." name="DATA_BYTE_HAS_BEEN_RECEIVED_NOT_ACK_HAS_BEEN_RETURNED" value="0x58"/>
        <value caption="Own SLA+W has been received; ACK has been returned." name="OWN_SLA_W_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x60"/>
        <value caption="Arbitration lost in SLA+R/W as Master; own SLA+W has been received; ACK has been returned." name="ARBITRATION_LOST_IN_SLA_R_W_AS_MASTER_OWN_SLA_W_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x68"/>
        <value caption="General call address has been received; ACK has been returned." name="GENERAL_CALL_ADDRESS_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x70"/>
        <value caption="Arbitration lost in SLA+R/W as Master; general call address has been received; ACK has been returned." name="ARBITRATION_LOST_IN_SLA_R_W_AS_MASTER_GENERAL_CALL_ADDRESS_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x78"/>
        <value caption="Previously addressed with own SLA+W; data has been received; ACK has been returned." name="PREVIOUSLY_ADDRESSED_WITH_OWN_SLA_W_DATA_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x80"/>
        <value caption="Previously addressed with own SLA+W; data has been received; NOT ACK has been returned." name="PREVIOUSLY_ADDRESSED_WITH_OWN_SLA_W_DATA_HAS_BEEN_RECEIVED_NOT_ACK_HAS_BEEN_RETURNED" value="0x88"/>
        <value caption="Previously addressed with general call; data has been received; ACK has been returned." name="PREVIOUSLY_ADDRESSED_WITH_GENERAL_CALL_DATA_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0x90"/>
        <value caption="Previously addressed with general call; data has been received; NOT ACK has been returned." name="PREVIOUSLY_ADDRESSED_WITH_GENERAL_CALL_DATA_HAS_BEEN_RECEIVED_NOT_ACK_HAS_BEEN_RETURNED" value="0x98"/>
        <value caption="A STOP condition or repeated START condition has been received while still addressed as Slave." name="A_STOP_CONDITION_OR_REPEATED_START_CONDITION_HAS_BEEN_RECEIVED_WHILE_STILL_ADDRESSED_AS_SLAVE" value="0xA0"/>
        <value caption="Own SLA+R has been received; ACK has been returned." name="OWN_SLA_R_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0xA8"/>
        <value caption="Arbitration lost in SLA+R/W as Master; own SLA+R has been received; ACK has been returned." name="ARBITRATION_LOST_IN_SLA_R_W_AS_MASTER_OWN_SLA_R_HAS_BEEN_RECEIVED_ACK_HAS_BEEN_RETURNED" value="0xB0"/>
        <value caption="Data byte in TWDR has been transmitted; ACK has been received." name="DATA_BYTE_IN_TWDR_HAS_BEEN_TRANSMITTED_ACK_HAS_BEEN_RECEIVED" value="0xB8"/>
        <value caption="Data byte in TWDR has been transmitted; NO ACK has been received." name="DATA_BYTE_IN_TWDR_HAS_BEEN_TRANSMITTED_NO_ACK_HAS_BEEN_RECEIVED" value="0xC0"/>
        <value caption="Last data byte in TWDR has been transmitted (TWEA = 0); ACK has been received." name="LAST_DATA_BYTE_IN_TWDR_HAS_BEEN_TRANSMITTED_TWEA_0_ACK_HAS_BEEN_RECEIVED" value="0xC8"/>
        <value caption="No relevant state information available; TWINT = 0." name="NO_RELEVANT_STATE_INFORMATION_AVAILABLE_TWINT_0" value="0xF8"/>
      </value-group>
      <value-group name="COMM_TWI_PRESACLE">
        <value caption="1" name="1" value="0x00"/>
        <value caption="4" name="4" value="0x01"/>
        <value caption="16" name="16" value="0x02"/>
        <value caption="64" name="64" value="0x03"/>
      </value-group>
    </module>
