Rahix/avr-device/vendor/atmega128rfa1.atdf
        <register caption="Timer/Counter3  Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register A  Bytes" name="OCR3A" offset="0x98" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register B  Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register C  Bytes" name="OCR3C" offset="0x9C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Input Capture Register  Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
          <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
          <bitfield caption="Timer/Counter3 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE3C"/>
          <bitfield caption="Timer/Counter3 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE3B"/>
          <bitfield caption="Timer/Counter3 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE3A"/>
          <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
        </register>
        <register caption="Timer/Counter3 Interrupt Flag Register" name="TIFR3" offset="0x38" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter3 Input Capture Flag" mask="0x20" name="ICF3"/>
          <bitfield caption="Timer/Counter3 Output Compare C Match Flag" mask="0x08" name="OCF3C"/>
          <bitfield caption="Timer/Counter3 Output Compare B Match Flag" mask="0x04" name="OCF3B"/>
          <bitfield caption="Timer/Counter3 Output Compare A Match Flag" mask="0x02" name="OCF3A"/>
          <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
          <bitfield caption="Compare Output Mode for Channel A" mask="0xC0" name="COM1A" values="TC1_COMNX_BITF"/>
          <bitfield caption="Compare Output Mode for Channel B" mask="0x30" name="COM1B" values="TC1_COMNX_BITF"/>
          <bitfield caption="Compare Output Mode for Channel C" mask="0x0C" name="COM1C" values="TC1_COMNX_BITF"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1" values="TC1_WGMX_BITF"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
          <bitfield caption="Input Capture 1 Noise Canceller" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Reserved Bit" mask="0x20" name="Res"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" values="TC1_WGMX_BITF" lsb="2"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT_MEGARF"/>
        </register>
        <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x82" size="1">
          <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC1A"/>
          <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC1B"/>
          <bitfield caption="Force Output Compare for Channel C" mask="0x20" name="FOC1C"/>
          <bitfield caption="Reserved" mask="0x1F" name="Res"/>
        </register>
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register A  Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register B  Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register C  Bytes" name="OCR1C" offset="0x8C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE1C"/>
          <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter1 Interrupt Flag Register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter1 Input Capture Flag" mask="0x20" name="ICF1"/>
          <bitfield caption="Timer/Counter1 Output Compare C Match Flag" mask="0x08" name="OCF1C"/>
          <bitfield caption="Timer/Counter1 Output Compare B Match Flag" mask="0x04" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Match Flag" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
      </register-group>
      <value-group name="TC4_COMNX_BITF">
        <value caption="Normal operation" name="NORMAL_OPERATION" value="0"/>
        <value caption="Reserved" name="RESERVED" value="1"/>
        <value caption="Reserved" name="RESERVED" value="2"/>
        <value caption="Reserved" name="RESERVED" value="3"/>
      </value-group>
      <value-group name="TC1_WGMX_BITF">
        <value caption="Normal mode of operation" name="NORMAL_MODE_OF_OPERATION" value="0x0"/>
        <value caption="PWM, phase correct, 8-bit" name="PWM_PHASE_CORRECT_8_BIT" value="0x1"/>
        <value caption="PWM, phase correct, 9-bit" name="PWM_PHASE_CORRECT_9_BIT" value="0x2"/>
        <value caption="PWM, phase correct, 10-bit" name="PWM_PHASE_CORRECT_10_BIT" value="0x3"/>
        <value caption="CTC, TOP = OCRnA" name="CTC_TOP_OCRNA" value="0x4"/>
        <value caption="Fast PWM, 8-bit" name="FAST_PWM_8_BIT" value="0x5"/>
        <value caption="Fast PWM, 9-bit" name="FAST_PWM_9_BIT" value="0x6"/>
        <value caption="Fast PWM, 10-bit" name="FAST_PWM_10_BIT" value="0x7"/>
        <value caption="PWM, Phase and frequency correct, TOP = ICRn" name="PWM_PHASE_AND_FREQUENCY_CORRECT_TOP_ICRN" value="0x8"/>
        <value caption="PWM, Phase and frequency correct, TOP = OCRnA" name="PWM_PHASE_AND_FREQUENCY_CORRECT_TOP_OCRNA" value="0x9"/>
        <value caption="PWM, Phase correct, TOP = ICRn" name="PWM_PHASE_CORRECT_TOP_ICRN" value="0xA"/>
        <value caption="PWM, Phase correct, TOP = OCRnA" name="PWM_PHASE_CORRECT_TOP_OCRNA" value="0xB"/>
        <value caption="CTC, TOP = OCRnA" name="CTC_TOP_OCRNA" value="0xC"/>
        <value caption="Reserved" name="RESERVED" value="0xD"/>
        <value caption="Fast PWM, TOP = ICRn" name="FAST_PWM_TOP_ICRN" value="0xE"/>
        <value caption="Fast PWM, TOP = OCRnA" name="FAST_PWM_TOP_OCRNA" value="0xF"/>
      </value-group>
