Rahix/avr-device/vendor/atmega128rfa1.atdf
      <value-group name="CLK_SEL_3BIT_NOEXT_MEGARF">
        <value caption="No clock source (Timer/Counter stopped)" name="NO_CLOCK_SOURCE_TIMER_COUNTER_STOPPED" value="0x00"/>
        <value caption="clk_IO/1 (no prescaling)" name="CLK_IO_1_NO_PRESCALING" value="0x01"/>
        <value caption="clk_IO/8 (from prescaler)" name="CLK_IO_8_FROM_PRESCALER" value="0x02"/>
        <value caption="clk_IO/64 (from prescaler)" name="CLK_IO_64_FROM_PRESCALER" value="0x03"/>
        <value caption="clk_IO/256 (from prescaler)" name="CLK_IO_256_FROM_PRESCALER" value="0x04"/>
        <value caption="clk_IO/1024 (from prescaler)" name="CLK_IO_1024_FROM_PRESCALER" value="0x05"/>
        <value caption="Reserved" name="RESERVED" value="0x06"/>
        <value caption="Reserved" name="RESERVED" value="0x07"/>
      </value-group>
      <value-group name="TC1_COMNX_BITF">
        <value caption="Normal port operation, OCnA/OCnB/OCnC disconnected." name="NORMAL_PORT_OPERATION_OCNA_OCNB_OCNC_DISCONNECTED" value="0"/>
        <value caption="Toggle OCnA/OCnB/OCnC on Compare Match." name="TOGGLE_OCNA_OCNB_OCNC_ON_COMPARE_MATCH" value="1"/>
        <value caption="Clear OCnA/OCnB/OCnC on Compare Match (set output to low level)." name="CLEAR_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_LOW_LEVEL" value="2"/>
        <value caption="Set OCnA/OCnB/OCnC on Compare Match (set output to high level)." name="SET_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_HIGH_LEVEL" value="3"/>
      </value-group>
      <value-group name="CLK_SEL_3BIT_EXT_MEGARF">
        <value caption="No clock source (Timer/Counter stopped)" name="NO_CLOCK_SOURCE_TIMER_COUNTER_STOPPED" value="0x00"/>
        <value caption="clk_IO/1 (no prescaling)" name="CLK_IO_1_NO_PRESCALING" value="0x01"/>
        <value caption="clk_IO/8 (from prescaler)" name="CLK_IO_8_FROM_PRESCALER" value="0x02"/>
        <value caption="clk_IO/64 (from prescaler)" name="CLK_IO_64_FROM_PRESCALER" value="0x03"/>
        <value caption="clk_IO/256 (from prescaler)" name="CLK_IO_256_FROM_PRESCALER" value="0x04"/>
        <value caption="clk_IO/1024 (from prescaler)" name="CLK_IO_1024_FROM_PRESCALER" value="0x05"/>
        <value caption="External clock source on Tn pin, clock on falling edge" name="EXTERNAL_CLOCK_SOURCE_ON_TN_PIN_CLOCK_ON_FALLING_EDGE" value="0x06"/>
        <value caption="External clock source on Tn pin, clock on rising edge" name="EXTERNAL_CLOCK_SOURCE_ON_TN_PIN_CLOCK_ON_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
      <register-group caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
        <register caption="AES Control Register" name="AES_CTRL" offset="0x13C" size="1">
          <bitfield caption="Request AES Operation." mask="0x80" name="AES_REQUEST"/>
          <bitfield caption="Set AES Operation Mode" mask="0x20" name="AES_MODE" values="AES_MODE_BITF"/>
          <bitfield caption="Set AES Operation Direction" mask="0x08" name="AES_DIR" values="AES_DIRECTION_BITF"/>
          <bitfield caption="AES Interrupt Enable" mask="0x04" name="AES_IM"/>
        </register>
        <register caption="AES Status Register" name="AES_STATUS" offset="0x13D" size="1" ocd-rw="R">
          <bitfield caption="AES Operation Finished with Error" mask="0x80" name="AES_ER"/>
          <bitfield caption="Reserved" mask="0x7E" name="Res"/>
          <bitfield caption="AES Operation Finished with Success" mask="0x01" name="AES_DONE"/>
        </register>
        <register caption="AES Plain and Cipher Text Buffer Register" name="AES_STATE" offset="0x13E" size="1">
          <bitfield caption="AES Plain and Cipher Text Buffer" mask="0xFF" name="AES_STATE"/>
        </register>
        <register caption="AES Encryption and Decryption Key Buffer Register" name="AES_KEY" offset="0x13F" size="1">
          <bitfield caption="AES Encryption/Decryption Key Buffer" mask="0xFF" name="AES_KEY"/>
        </register>
        <register caption="Transceiver Status Register" name="TRX_STATUS" offset="0x141" size="1" ocd-rw="R">
          <bitfield caption="CCA Algorithm Status" mask="0x80" name="CCA_DONE" values="CCA_DONE_bitf"/>
          <bitfield caption="CCA Status Result" mask="0x40" name="CCA_STATUS" values="CCA_STATUS_bitf"/>
          <bitfield caption="Test mode status" mask="0x20" name="TST_STATUS" values="TST_STATUS_bitf"/>
          <bitfield caption="Transceiver Main Status" mask="0x1F" name="TRX_STATUS" values="TRX_STATUS_bitf"/>
        </register>
        <register caption="Transceiver State Control Register" name="TRX_STATE" offset="0x142" size="1">
          <bitfield caption="Transaction Status" mask="0xE0" name="TRAC_STATUS" values="TRAC_STATUS_bitf"/>
          <bitfield caption="State Control Command" mask="0x1F" name="TRX_CMD" values="TRX_CMD_bitf"/>
        </register>
        <register caption="Reserved" name="TRX_CTRL_0" offset="0x143" size="1">
          <bitfield caption="Reserved" mask="0xFF" name="Res"/>
        </register>
        <register caption="Transceiver Control Register 1" name="TRX_CTRL_1" offset="0x144" size="1">
          <bitfield caption="External PA support enable" mask="0x80" name="PA_EXT_EN"/>
          <bitfield caption="Connect Frame Start IRQ to TC1" mask="0x40" name="IRQ_2_EXT_EN"/>
          <bitfield caption="Enable Automatic CRC Calculation" mask="0x20" name="TX_AUTO_CRC_ON"/>
          <bitfield caption="Reserved" mask="0x1F" name="Res"/>
        </register>
        <register caption="Transceiver Transmit Power Control Register" name="PHY_TX_PWR" offset="0x145" size="1">
          <bitfield caption="Power Amplifier Buffer Lead Time" mask="0xC0" name="PA_BUF_LT" values="PA_BUF_LT_bitf"/>
          <bitfield caption="Power Amplifier Lead Time" mask="0x30" name="PA_LT" values="PA_LT_bitf"/>
          <bitfield caption="Transmit Power Setting" mask="0x0F" name="TX_PWR" values="TX_PWR_bitf"/>
        </register>
        <register caption="Receiver Signal Strength Indicator Register" name="PHY_RSSI" offset="0x146" size="1" ocd-rw="R">
          <bitfield caption="Received Frame CRC Status" mask="0x80" name="RX_CRC_VALID" values="RX_CRC_VALID_bitf"/>
          <bitfield caption="Random Value" mask="0x60" name="RND_VALUE"/>
          <bitfield caption="Receiver Signal Strength Indicator" mask="0x1F" name="RSSI" values="RSSI_VALUE_BITF"/>
        </register>
        <register caption="Transceiver Energy Detection Level Register" name="PHY_ED_LEVEL" offset="0x147" size="1" ocd-rw="R">
          <bitfield caption="Energy Detection Level" mask="0xFF" name="ED_LEVEL" values="ED_LEVEL_BITF"/>
        </register>
        <register caption="Transceiver Clear Channel Assessment (CCA) Control Register" name="PHY_CC_CCA" offset="0x148" size="1">
          <bitfield caption="Manual CCA Measurement Request" mask="0x80" name="CCA_REQUEST"/>
          <bitfield caption="Select CCA Measurement Mode" mask="0x60" name="CCA_MODE" values="CCA_MODE_bitf"/>
          <bitfield caption="RX/TX Channel Selection" mask="0x1F" name="CHANNEL" values="CHANNEL_bitf"/>
        </register>
        <register caption="Transceiver CCA Threshold Setting Register" name="CCA_THRES" offset="0x149" size="1">
          <bitfield caption="CS Threshold Level for CCA Measurement" mask="0xF0" name="CCA_CS_THRES"/>
          <bitfield caption="ED Threshold Level for CCA Measurement" mask="0x0F" name="CCA_ED_THRES"/>
        </register>
        <register caption="Transceiver Receive Control Register" name="RX_CTRL" offset="0x14A" size="1">
          <bitfield caption="Receiver Sensitivity Control" mask="0x0F" name="PDT_THRES" values="PDT_THRES_bitf"/>
        </register>
        <register caption="Start of Frame Delimiter Value Register" name="SFD_VALUE" offset="0x14B" size="1">
          <bitfield caption="Start of Frame Delimiter Value" mask="0xFF" name="SFD_VALUE" values="SFD_VALUE_BITF"/>
        </register>
        <register caption="Transceiver Control Register 2" name="TRX_CTRL_2" offset="0x14C" size="1">
          <bitfield caption="RX Safe Mode" mask="0x80" name="RX_SAFE_MODE"/>
          <bitfield caption="Reserved" mask="0x7C" name="Res"/>
          <bitfield caption="Data Rate Selection" mask="0x03" name="OQPSK_DATA_RATE" values="OQPSK_DATA_RATE_bitf"/>
        </register>
        <register caption="Antenna Diversity Control Register" name="ANT_DIV" offset="0x14D" size="1">
          <bitfield caption="Antenna Diversity Antenna Status" mask="0x80" name="ANT_SEL" values="ANT_SEL_bitf"/>
          <bitfield caption="Reserved" mask="0x70" name="Res"/>
          <bitfield caption="Enable Antenna Diversity" mask="0x08" name="ANT_DIV_EN" values="ANT_DIV_EN_bitf"/>
          <bitfield caption="Enable External Antenna Switch Control" mask="0x04" name="ANT_EXT_SW_EN" values="ANT_EXT_SW_EN_bitf"/>
          <bitfield caption="Static Antenna Diversity Switch Control" mask="0x03" name="ANT_CTRL" values="ANT_CTRL_bitf"/>
        </register>
        <register caption="Transceiver Interrupt Enable Register" name="IRQ_MASK" offset="0x14E" size="1">
          <bitfield caption="Awake Interrupt Enable" mask="0x80" name="AWAKE_EN"/>
          <bitfield caption="TX_END Interrupt Enable" mask="0x40" name="TX_END_EN"/>
          <bitfield caption="Address Match Interrupt Enable" mask="0x20" name="AMI_EN"/>
          <bitfield caption="End of ED Measurement Interrupt Enable" mask="0x10" name="CCA_ED_DONE_EN"/>
          <bitfield caption="RX_END Interrupt Enable" mask="0x08" name="RX_END_EN"/>
          <bitfield caption="RX_START Interrupt Enable" mask="0x04" name="RX_START_EN"/>
          <bitfield caption="PLL Unlock Interrupt Enable" mask="0x02" name="PLL_UNLOCK_EN"/>
          <bitfield caption="PLL Lock Interrupt Enable" mask="0x01" name="PLL_LOCK_EN"/>
        </register>
        <register caption="Transceiver Interrupt Status Register" name="IRQ_STATUS" offset="0x14F" size="1">
          <bitfield caption="Awake Interrupt Status" mask="0x80" name="AWAKE"/>
          <bitfield caption="TX_END Interrupt Status" mask="0x40" name="TX_END"/>
          <bitfield caption="Address Match Interrupt Status" mask="0x20" name="AMI"/>
          <bitfield caption="End of ED Measurement Interrupt Status" mask="0x10" name="CCA_ED_DONE"/>
          <bitfield caption="RX_END Interrupt Status" mask="0x08" name="RX_END"/>
          <bitfield caption="RX_START Interrupt Status" mask="0x04" name="RX_START"/>
          <bitfield caption="PLL Unlock Interrupt Status" mask="0x02" name="PLL_UNLOCK"/>
          <bitfield caption="PLL Lock Interrupt Status" mask="0x01" name="PLL_LOCK"/>
        </register>
        <register caption="Voltage Regulator Control and Status Register" name="VREG_CTRL" offset="0x150" size="1">
          <bitfield caption="Use External AVDD Regulator" mask="0x80" name="AVREG_EXT" values="AVREG_EXT_BITF"/>
          <bitfield caption="AVDD Supply Voltage Valid" mask="0x40" name="AVDD_OK" values="AVDD_OK_BITF"/>
          <bitfield caption="Use External DVDD Regulator" mask="0x08" name="DVREG_EXT" values="DVREG_EXT_BITF"/>
          <bitfield caption="DVDD Supply Voltage Valid" mask="0x04" name="DVDD_OK" values="DVDD_OK_BITF"/>
        </register>
