Rahix/avr-device/vendor/atmega128rfa1.atdf
        <register caption="Transceiver MAC IEEE Address Register 0" name="IEEE_ADDR_0" offset="0x164" size="1">
          <bitfield caption="MAC IEEE Address" mask="0x80" name="IEEE_ADDR_07"/>
          <bitfield caption="MAC IEEE Address" mask="0x40" name="IEEE_ADDR_06"/>
          <bitfield caption="MAC IEEE Address" mask="0x20" name="IEEE_ADDR_05"/>
          <bitfield caption="MAC IEEE Address" mask="0x10" name="IEEE_ADDR_04"/>
          <bitfield caption="MAC IEEE Address" mask="0x08" name="IEEE_ADDR_03"/>
          <bitfield caption="MAC IEEE Address" mask="0x04" name="IEEE_ADDR_02"/>
          <bitfield caption="MAC IEEE Address" mask="0x02" name="IEEE_ADDR_01"/>
          <bitfield caption="MAC IEEE Address" mask="0x01" name="IEEE_ADDR_00"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 1" name="IEEE_ADDR_1" offset="0x165" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="10"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 2" name="IEEE_ADDR_2" offset="0x166" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="20"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 3" name="IEEE_ADDR_3" offset="0x167" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="30"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 4" name="IEEE_ADDR_4" offset="0x168" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="40"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 5" name="IEEE_ADDR_5" offset="0x169" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="50"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 6" name="IEEE_ADDR_6" offset="0x16A" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="60"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 7" name="IEEE_ADDR_7" offset="0x16B" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="70"/>
        </register>
        <register caption="Transceiver Extended Operating Mode Control Register" name="XAH_CTRL_0" offset="0x16C" size="1">
          <bitfield caption="Maximum Number of Frame Re-transmission Attempts" mask="0xF0" name="MAX_FRAME_RETRIES" values="MAX_FRAME_RETRIES_bitf"/>
          <bitfield caption="Maximum Number of CSMA-CA Procedure Repetition Attempts" mask="0x0E" name="MAX_CSMA_RETRIES" values="MAX_CSMA_RETRIES_bitf"/>
          <bitfield caption="Set Slotted Acknowledgment" mask="0x01" name="SLOTTED_OPERATION" values="SLOTTED_OPERATION_BITF"/>
        </register>
        <register caption="Transceiver CSMA-CA Random Number Generator Seed Register" name="CSMA_SEED_0" offset="0x16D" size="1">
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x80" name="CSMA_SEED_07"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x40" name="CSMA_SEED_06"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x20" name="CSMA_SEED_05"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x10" name="CSMA_SEED_04"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x08" name="CSMA_SEED_03"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x04" name="CSMA_SEED_02"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x02" name="CSMA_SEED_01"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x01" name="CSMA_SEED_00"/>
        </register>
        <register caption="Transceiver Acknowledgment Frame Control Register 2" name="CSMA_SEED_1" offset="0x16E" size="1">
          <bitfield caption="Acknowledgment Frame Filter Mode" mask="0xC0" name="AACK_FVN_MODE" values="AACK_FVN_MODE_bitf"/>
          <bitfield caption="Set Frame Pending Sub-field" mask="0x20" name="AACK_SET_PD"/>
          <bitfield caption="Disable Acknowledgment Frame Transmission" mask="0x10" name="AACK_DIS_ACK"/>
          <bitfield caption="Set Personal Area Network Coordinator" mask="0x08" name="AACK_I_AM_COORD"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x07" name="CSMA_SEED_1"/>
        </register>
        <register caption="Transceiver CSMA-CA Back-off Exponent Control Register" name="CSMA_BE" offset="0x16F" size="1">
          <bitfield caption="Maximum Back-off Exponent" mask="0xF0" name="MAX_BE" values="MAX_BE_bitf"/>
          <bitfield caption="Minimum Back-off Exponent" mask="0x0F" name="MIN_BE" values="MIN_BE_bitf"/>
        </register>
        <register caption="Transceiver Digital Test Control Register" name="TST_CTRL_DIGI" offset="0x176" size="1">
          <bitfield caption="Digital Test Controller Register" mask="0x0F" name="TST_CTRL_DIG" values="TST_CTRL_DIG_BITF"/>
        </register>
        <register caption="Transceiver Received Frame Length Register" name="TST_RX_LENGTH" offset="0x17B" size="1">
          <bitfield caption="Received Frame Length" mask="0xFF" name="RX_LENGTH"/>
        </register>
        <register caption="Start of frame buffer" name="TRXFBST" offset="0x180" size="1" mask="0xFF"/>
        <register caption="End of frame buffer" name="TRXFBEND" offset="0x1FF" size="1" mask="0xFF"/>
      </register-group>
      <value-group name="AES_MODE_BITF">
        <value caption="AES Mode is ECB (Electronic Code Book)." name="AES_MODE_ECB" value="0"/>
        <value caption="AES Mode is CBC (Cipher Block Chaining)." name="AES_MODE_CBC" value="1"/>
      </value-group>
      <value-group name="AES_DIRECTION_BITF">
        <value caption="AES operation is encryption." name="AES_DIR_ENC" value="0"/>
        <value caption="AES operation is decryption." name="AES_DIR_DEC" value="1"/>
      </value-group>
      <value-group name="CCA_DONE_bitf">
        <value caption="CCA calculation not finished" name="CCA_NOT_FIN" value="0"/>
        <value caption="CCA calculation finished" name="CCA_FIN" value="1"/>
      </value-group>
      <value-group name="CCA_STATUS_bitf">
        <value caption="Channel indicated as busy." name="CCA_BUSY" value="0"/>
        <value caption="Channel indicated as idle." name="CCA_IDLE" value="1"/>
      </value-group>
      <value-group name="TST_STATUS_bitf">
        <value caption="Test mode is disabled." name="TST_DISABLED" value="0"/>
        <value caption="Test mode is active." name="TST_ENABLED" value="1"/>
      </value-group>
      <value-group name="TRX_STATUS_bitf">
        <value caption="P_ON" name="P_ON" value="0x00"/>
        <value caption="BUSY_RX" name="BUSY_RX" value="0x01"/>
        <value caption="BUSY_TX" name="BUSY_TX" value="0x02"/>
        <value caption="RX_ON" name="RX_ON" value="0x06"/>
        <value caption="TRX_OFF" name="TRX_OFF" value="0x08"/>
        <value caption="PLL_ON" name="PLL_ON" value="0x09"/>
        <value caption="SLEEP" name="SLEEP" value="0x0F"/>
        <value caption="BUSY_RX_AACK" name="BUSY_RX_AACK" value="0x11"/>
        <value caption="BUSY_TX_ARET" name="BUSY_TX_ARET" value="0x12"/>
        <value caption="RX_AACK_ON" name="RX_AACK_ON" value="0x16"/>
        <value caption="TX_ARET_ON" name="TX_ARET_ON" value="0x19"/>
        <value caption="STATE_TRANSITION_IN_PROGRESS" name="STATE_TRANSITION_IN_PROGRESS" value="0x1F"/>
      </value-group>
      <value-group name="TRAC_STATUS_bitf">
        <value caption="SUCCESS (RX_AACK, TX_ARET)" name="TRAC_SUCCESS" value="0"/>
        <value caption="SUCCESS_DATA_PENDING (TX_ARET)" name="TRAC_SUCCESS_DATA_PENDING" value="1"/>
        <value caption="SUCCESS_WAIT_FOR_ACK (RX_AACK)" name="TRAC_SUCCESS_WAIT_FOR_ACK" value="2"/>
        <value caption="CHANNEL_ACCESS_FAILURE (TX_ARET)" name="TRAC_CHANNEL_ACCESS_FAILURE" value="3"/>
        <value caption="NO_ACK (TX_ARET)" name="TRAC_NO_ACK" value="5"/>
        <value caption="INVALID (RX_AACK, TX_ARET)" name="TRAC_INVALID" value="7"/>
      </value-group>
      <value-group name="TRX_CMD_bitf">
        <value caption="NOP" name="CMD_NOP" value="0x00"/>
        <value caption="TX_START" name="CMD_TX_START" value="0x02"/>
        <value caption="FORCE_TRX_OFF" name="CMD_FORCE_TRX_OFF" value="0x03"/>
        <value caption="FORCE_PLL_ON" name="CMD_FORCE_PLL_ON" value="0x04"/>
        <value caption="RX_ON" name="CMD_RX_ON" value="0x06"/>
        <value caption="TRX_OFF" name="CMD_TRX_OFF" value="0x08"/>
        <value caption="PLL_ON (TX_ON)" name="CMD_PLL_ON" value="0x09"/>
        <value caption="RX_AACK_ON" name="CMD_RX_AACK_ON" value="0x16"/>
        <value caption="TX_ARET_ON" name="CMD_TX_ARET_ON" value="0x19"/>
      </value-group>
      <value-group name="PA_BUF_LT_bitf">
        <value caption="0 us" name="PA_BUF_LT_0US" value="0"/>
        <value caption="2 us" name="PA_BUF_LT_2US" value="1"/>
        <value caption="4 us" name="PA_BUF_LT_4US" value="2"/>
        <value caption="6 us" name="PA_BUF_LT_6US" value="3"/>
      </value-group>
      <value-group name="PA_LT_bitf">
        <value caption="2 us" name="PA_LT_2US" value="0"/>
        <value caption="4 us" name="PA_LT_4US" value="1"/>
        <value caption="6 us" name="PA_LT_6US" value="2"/>
        <value caption="8 us" name="PA_LT_8US" value="3"/>
      </value-group>
      <value-group name="TX_PWR_bitf">
        <value caption="3.0 dBm" name="3_0_DBM" value="0"/>
        <value caption="2.8 dBm" name="2_8_DBM" value="1"/>
        <value caption="2.3 dBm" name="2_3_DBM" value="2"/>
        <value caption="1.8 dBm" name="1_8_DBM" value="3"/>
        <value caption="1.3 dBm" name="1_3_DBM" value="4"/>
        <value caption="0.7 dBm" name="0_7_DBM" value="5"/>
        <value caption="0.0 dBm" name="0_0_DBM" value="6"/>
        <value caption=" -1 dBm" name="_1_DBM" value="7"/>
        <value caption=" -2 dBm" name="_2_DBM" value="8"/>
        <value caption=" -3 dBm" name="_3_DBM" value="9"/>
        <value caption=" -4 dBm" name="_4_DBM" value="10"/>
        <value caption=" -5 dBm" name="_5_DBM" value="11"/>
        <value caption=" -7 dBm" name="_7_DBM" value="12"/>
        <value caption=" -9 dBm" name="_9_DBM" value="13"/>
        <value caption="-12 dBm" name="_12_DBM" value="14"/>
        <value caption="-17 dBm" name="_17_DBM" value="15"/>
      </value-group>
      <value-group name="RX_CRC_VALID_bitf">
        <value caption="CRC (FCS) not valid" name="CRC_INVALID" value="0"/>
        <value caption="CRC (FCS) valid" name="CRC_VALID" value="1"/>
      </value-group>
      <value-group name="RSSI_VALUE_BITF">
        <value caption="Minimum RSSI value: P(RF) &lt; -90 dBm" name="RSSI_MIN" value="0"/>
        <value caption="P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]" name="RSSI_MIN_PLUS_3dB" value="1"/>
        <value caption="..." name="VAL_2" value="2"/>
        <value caption="Maximum RSSI value: P(RF) ≥ -10 dBm" name="RSSI_MAX" value="28"/>
      </value-group>
      <value-group name="ED_LEVEL_BITF">
        <value caption="Minimum result of last ED measurement" name="ED_MIN" value="0x00"/>
        <value caption="P(RF) = RSSI_BASE_VAL+ED [dBm]" name="ED_MIN_PLUS_1dB" value="0x01"/>
        <value caption="..." name="VAL_0x02" value="0x02"/>
        <value caption="Maximum result of last ED measurement" name="ED_MAX" value="0x54"/>
        <value caption="Reset value" name="ED_RESET" value="0xFF"/>
      </value-group>
