Rahix/avr-device/vendor/atmega128rfa1.atdf
      <value-group name="VERSION_NUM_BITF">
        <value caption="Revision A" name="REV_A" value="2"/>
        <value caption="Revision B" name="REV_B" value="3"/>
      </value-group>
      <value-group name="MAN_ID_0_BITF">
        <value caption="Atmel JEDEC manufacturer ID, bits [7:0] of 32 bit manufacturer ID: 00 00 00 1F" name="ATMEL_BYTE_0" value="0x1f"/>
      </value-group>
      <value-group name="MAN_ID_1_BITF">
        <value caption="Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F" name="ATMEL_BYTE_1" value="0x00"/>
      </value-group>
      <value-group name="MAX_FRAME_RETRIES_bitf">
        <value caption="Retransmission of frame is not attempted." name="RETRANSMISSION_OF_FRAME_IS_NOT_ATTEMPTED" value="0x0"/>
        <value caption="Retransmission of frame is attempted once." name="RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_ONCE" value="0x1"/>
        <value caption="..." name="RESERVED" value="0x2"/>
        <value caption="Retransmission of frame is attempted 15 times." name="RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_15_TIMES" value="0xF"/>
      </value-group>
      <value-group name="MAX_CSMA_RETRIES_bitf">
        <value caption="No repetition of CSMA-CA procedure" name="NO_REPETITION_OF_CSMA_CA_PROCEDURE" value="0x0"/>
        <value caption="One repetition of CSMA-CA procedure" name="ONE_REPETITION_OF_CSMA_CA_PROCEDURE" value="0x1"/>
        <value caption="..." name="RESERVED" value="0x2"/>
        <value caption="Five repetitions (highest IEEE 802.15.4 compliant value)" name="FIVE_REPETITIONS_HIGHEST_IEEE_802_15_4_COMPLIANT_VALUE" value="0x5"/>
        <value caption="Reserved" name="RESERVED" value="0x6"/>
        <value caption="Immediate frame re-transmission without performing CSMA-CA" name="IMMEDIATE_FRAME_RE_TRANSMISSION_WITHOUT_PERFORMING_CSMA_CA" value="0x7"/>
      </value-group>
      <value-group name="SLOTTED_OPERATION_BITF">
        <value caption="The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested." name="SLOTTED_OP_DIS" value="0"/>
        <value caption="The transmission of an acknowledgment frame has to be controlled by the microcontroller." name="SLOTTED_OP_EN" value="1"/>
      </value-group>
      <value-group name="AACK_FVN_MODE_bitf">
        <value caption="Acknowledge frames with version number 0" name="ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0" value="0"/>
        <value caption="Acknowledge frames with version number 0 or 1" name="ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1" value="1"/>
        <value caption="Acknowledge frames with version number 0 or 1 or 2" name="ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1_OR_2" value="2"/>
        <value caption="Acknowledge frames independent of frame version number" name="ACKNOWLEDGE_FRAMES_INDEPENDENT_OF_FRAME_VERSION_NUMBER" value="3"/>
      </value-group>
      <value-group name="MAX_BE_bitf">
        <value caption="This value is not valid for the maximum back-off exponent." name="THIS_VALUE_IS_NOT_VALID_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT" value="1"/>
        <value caption="This value is not valid for the maximum back-off exponent." name="THIS_VALUE_IS_NOT_VALID_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT" value="2"/>
        <value caption="Minimum, IEEE compliant value for the maximum back-off exponent." name="MINIMUM_IEEE_COMPLIANT_VALUE_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT" value="3"/>
        <value caption="..." name="RESERVED" value="4"/>
        <value caption="Maximum, IEEE compliant value for the maximum back-off exponent." name="MAXIMUM_IEEE_COMPLIANT_VALUE_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT" value="8"/>
      </value-group>
      <value-group name="MIN_BE_bitf">
        <value caption="Minimum value of minimum back-off exponent." name="MINIMUM_VALUE_OF_MINIMUM_BACK_OFF_EXPONENT" value="0"/>
        <value caption="..." name="RESERVED" value="1"/>
        <value caption="Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE." name="MAXIMUM_VALUE_OF_MINIMUM_BACK_OFF_EXPONENT_MIN_BE_MUST_BE_SMALLER_OR_EQUAL_TO_MAX_BE" value="8"/>
      </value-group>
      <value-group name="TST_CTRL_DIG_BITF">
        <value caption="NORMAL (no test is active)" name="NORMAL_NO_TEST_IS_ACTIVE" value="0"/>
        <value caption="TST_CONT_TX (continuous transmit)" name="TST_CONT_TX_CONTINUOUS_TRANSMIT" value="15"/>
      </value-group>
    </module>
    <module caption="MAC Symbol Counter" name="SYMCNT">
      <register-group caption="MAC Symbol Counter" name="SYMCNT">
        <register caption="Symbol Counter Output Compare Register 1 HH-Byte" name="SCOCR1HH" offset="0xF8" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 1 HH-Byte" mask="0xFF" name="SCOCR1HH"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 1 HL-Byte" name="SCOCR1HL" offset="0xF7" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 1 HL-Byte" mask="0xFF" name="SCOCR1HL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 1 LH-Byte" name="SCOCR1LH" offset="0xF6" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 1 LH-Byte" mask="0xFF" name="SCOCR1LH"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 1 LL-Byte" name="SCOCR1LL" offset="0xF5" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 1 LL-Byte" mask="0xFF" name="SCOCR1LL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 2 HH-Byte" name="SCOCR2HH" offset="0xF4" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 2 HH-Byte" mask="0xFF" name="SCOCR2HH"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 2 HL-Byte" name="SCOCR2HL" offset="0xF3" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 2 HL-Byte" mask="0xFF" name="SCOCR2HL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 2 LH-Byte" name="SCOCR2LH" offset="0xF2" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 2 LH-Byte" mask="0xFF" name="SCOCR2LH"/>
        </register>
