Rahix/avr-device/vendor/atmega128rfa1.atdf
        <register caption="Symbol Counter Output Compare Register 2 LL-Byte" name="SCOCR2LL" offset="0xF1" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 2 LL-Byte" mask="0xFF" name="SCOCR2LL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 3 HH-Byte" name="SCOCR3HH" offset="0xF0" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 3 HH-Byte" mask="0xFF" name="SCOCR3HH"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 3 HL-Byte" name="SCOCR3HL" offset="0xEF" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 3 HL-Byte" mask="0xFF" name="SCOCR3HL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 3 LH-Byte" name="SCOCR3LH" offset="0xEE" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 3 LH-Byte" mask="0xFF" name="SCOCR3LH"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 3 LL-Byte" name="SCOCR3LL" offset="0xED" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 3 LL-Byte" mask="0xFF" name="SCOCR3LL"/>
        </register>
        <register caption="Symbol Counter Frame Timestamp Register HH-Byte" name="SCTSRHH" offset="0xEC" size="1" ocd-rw="R">
          <bitfield caption="Symbol Counter Frame Timestamp Register HH-Byte" mask="0xFF" name="SCTSRHH"/>
        </register>
        <register caption="Symbol Counter Frame Timestamp Register HL-Byte" name="SCTSRHL" offset="0xEB" size="1" ocd-rw="R">
          <bitfield caption="Symbol Counter Frame Timestamp Register HL-Byte" mask="0xFF" name="SCTSRHL"/>
        </register>
        <register caption="Symbol Counter Frame Timestamp Register LH-Byte" name="SCTSRLH" offset="0xEA" size="1" ocd-rw="R">
          <bitfield caption="Symbol Counter Frame Timestamp Register LH-Byte" mask="0xFF" name="SCTSRLH"/>
        </register>
        <register caption="Symbol Counter Frame Timestamp Register LL-Byte" name="SCTSRLL" offset="0xE9" size="1" ocd-rw="R">
          <bitfield caption="Symbol Counter Frame Timestamp Register LL-Byte" mask="0xFF" name="SCTSRLL"/>
        </register>
        <register caption="Symbol Counter Beacon Timestamp Register HH-Byte" name="SCBTSRHH" offset="0xE8" size="1">
          <bitfield caption="Symbol Counter Beacon Timestamp Register HH-Byte" mask="0xFF" name="SCBTSRHH"/>
        </register>
        <register caption="Symbol Counter Beacon Timestamp Register HL-Byte" name="SCBTSRHL" offset="0xE7" size="1">
          <bitfield caption="Symbol Counter Beacon Timestamp Register HL-Byte" mask="0xFF" name="SCBTSRHL"/>
        </register>
        <register caption="Symbol Counter Beacon Timestamp Register LH-Byte" name="SCBTSRLH" offset="0xE6" size="1">
          <bitfield caption="Symbol Counter Beacon Timestamp Register LH-Byte" mask="0xFF" name="SCBTSRLH"/>
        </register>
        <register caption="Symbol Counter Beacon Timestamp Register LL-Byte" name="SCBTSRLL" offset="0xE5" size="1">
          <bitfield caption="Symbol Counter Beacon Timestamp Register LL-Byte" mask="0xFF" name="SCBTSRLL"/>
        </register>
        <register caption="Symbol Counter Register HH-Byte" name="SCCNTHH" offset="0xE4" size="1">
          <bitfield caption="Symbol Counter Register HH-Byte" mask="0xFF" name="SCCNTHH"/>
        </register>
        <register caption="Symbol Counter Register HL-Byte" name="SCCNTHL" offset="0xE3" size="1">
          <bitfield caption="Symbol Counter Register HL-Byte" mask="0xFF" name="SCCNTHL"/>
        </register>
        <register caption="Symbol Counter Register LH-Byte" name="SCCNTLH" offset="0xE2" size="1">
          <bitfield caption="Symbol Counter Register LH-Byte" mask="0xFF" name="SCCNTLH"/>
        </register>
        <register caption="Symbol Counter Register LL-Byte" name="SCCNTLL" offset="0xE1" size="1">
          <bitfield caption="Symbol Counter Register LL-Byte" mask="0xFF" name="SCCNTLL"/>
        </register>
        <register caption="Symbol Counter Interrupt Status Register" name="SCIRQS" offset="0xE0" size="1">
          <bitfield caption="Reserved Bit" mask="0xE0" name="Res"/>
          <bitfield caption="Backoff Slot Counter IRQ" mask="0x10" name="IRQSBO"/>
          <bitfield caption="Symbol Counter Overflow IRQ" mask="0x08" name="IRQSOF"/>
          <bitfield caption="Compare Unit 3 Compare Match IRQ" mask="0x07" name="IRQSCP" lsb="1"/>
        </register>
        <register caption="Symbol Counter Interrupt Mask Register" name="SCIRQM" offset="0xDF" size="1">
          <bitfield caption="Reserved Bit" mask="0xE0" name="Res"/>
          <bitfield caption="Backoff Slot Counter IRQ enable" mask="0x10" name="IRQMBO"/>
          <bitfield caption="Symbol Counter Overflow IRQ enable" mask="0x08" name="IRQMOF"/>
          <bitfield caption="Symbol Counter Compare Match 3 IRQ enable" mask="0x07" name="IRQMCP" lsb="1"/>
        </register>
        <register caption="Symbol Counter Status Register" name="SCSR" offset="0xDE" size="1" ocd-rw="R">
          <bitfield caption="Reserved Bit" mask="0xFE" name="Res"/>
          <bitfield caption="Symbol Counter busy" mask="0x01" name="SCBSY"/>
        </register>
        <register caption="Symbol Counter Control Register 1" name="SCCR1" offset="0xDD" size="1">
          <bitfield caption="Reserved Bit" mask="0xFE" name="Res"/>
          <bitfield caption="Backoff Slot Counter enable" mask="0x01" name="SCENBO"/>
        </register>
        <register caption="Symbol Counter Control Register 0" name="SCCR0" offset="0xDC" size="1">
          <bitfield caption="Symbol Counter Synchronization" mask="0x80" name="SCRES"/>
          <bitfield caption="Manual Beacon Timestamp" mask="0x40" name="SCMBTS"/>
          <bitfield caption="Symbol Counter enable" mask="0x20" name="SCEN"/>
          <bitfield caption="Symbol Counter Clock Source select" mask="0x10" name="SCCKSEL"/>
          <bitfield caption="Symbol Counter Automatic Timestamping enable" mask="0x08" name="SCTSE"/>
          <bitfield caption="Symbol Counter Compare Unit 3 Mode select" mask="0x07" name="SCCMP" lsb="1"/>
        </register>
      </register-group>
    </module>
