Rahix/avr-device/vendor/atmega128rfa1.atdf
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register  Bytes" name="EEAR" offset="0x41" size="2" mask="0xFFFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="Reserved" mask="0xC0" name="Res"/>
          <bitfield caption="EEPROM Programming Mode" mask="0x30" name="EEPM" values="EEP_MODE2"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Programming Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE2">
        <value caption="Erase and Write in one operation (Atomic Operation)" name="ERASE_AND_WRITE_IN_ONE_OPERATION_ATOMIC_OPERATION" value="0x00"/>
        <value caption="Erase only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write only" name="WRITE_ONLY" value="0x02"/>
        <value caption="Reserved for future use" name="RESERVED_FOR_FUTURE_USE" value="0x03"/>
      </value-group>
    </module>
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Register" name="OCDR" offset="0x51" size="1" ocd-rw="">
          <bitfield caption="On-Chip Debug Register Data" mask="0xFF" name="OCDR" values="OCDR_DATA_BITF"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
        </register>
      </register-group>
      <value-group name="OCDR_DATA_BITF">
        <value caption="Refer to the debugger documentation for further information on how to use this register." name="REFER_TO_THE_DEBUGGER_DOCUMENTATION_FOR_FURTHER_INFORMATION_ON_HOW_TO_USE_THIS_REGISTER" value="0"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt 3 Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 2 Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 1 Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 0 Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL3"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
          <bitfield caption="External Interrupt 7 Sense Control Bit" mask="0xC0" name="ISC7" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 6 Sense Control Bit" mask="0x30" name="ISC6" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 5 Sense Control Bit" mask="0x0C" name="ISC5" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 4 Sense Control Bit" mask="0x03" name="ISC4" values="INTERRUPT_SENSE_CONTROL3"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request Enable" mask="0xFF" name="INT" values="INTERRUPT_REQ_ENABLE_BITF"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flag" mask="0xFF" name="INTF" values="INTERRUPT_EXT_FLAG_BITF"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
          <bitfield caption="Pin Change Enable Mask" mask="0xFF" name="PCINT" lsb="16"/>
        </register>
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
          <bitfield caption="Pin Change Enable Mask" mask="0xFF" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF"/>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
          <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
          <bitfield caption="Pin Change Interrupt Flags" mask="0x07" name="PCIF"/>
        </register>
        <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
          <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
          <bitfield caption="Pin Change Interrupt Enables" mask="0x07" name="PCIE"/>
        </register>
      </register-group>
      <value-group name="INTERRUPT_SENSE_CONTROL3">
        <value caption="The low level of INTn generates an interrupt request." name="THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST" value="0x00"/>
        <value caption="Any edge of INTn generates asynchronously an interrupt request." name="ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST" value="0x01"/>
        <value caption="The falling edge of INTn generates asynchronously an interrupt request." name="THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST" value="0x02"/>
        <value caption="The rising edge of INTn generates asynchronously an interrupt request." name="THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST" value="0x03"/>
      </value-group>
      <value-group name="INTERRUPT_REQ_ENABLE_BITF">
        <value caption="All external pin interrupts are disabled." name="ALL_EXTERNAL_PIN_INTERRUPTS_ARE_DISABLED" value="0x00"/>
        <value caption="All external pin interrupts are enabled." name="ALL_EXTERNAL_PIN_INTERRUPTS_ARE_ENABLED" value="0xff"/>
      </value-group>
      <value-group name="INTERRUPT_EXT_FLAG_BITF">
        <value caption="No edge or logic change on INT7:0 occurred." name="NO_EDGE_OR_LOGIC_CHANGE_ON_INT7_0_OCCURRED" value="0x00"/>
        <value caption="A edge or logic change on INT0 occurred and triggered an interrupt request." name="A_EDGE_OR_LOGIC_CHANGE_ON_INT0_OCCURRED_AND_TRIGGERED_AN_INTERRUPT_REQUEST" value="0x01"/>
        <value caption="..." name="RESERVED" value="0x02"/>
        <value caption="A edge or logic change on INT7 occurred and triggered an interrupt request." name="A_EDGE_OR_LOGIC_CHANGE_ON_INT7_OCCURRED_AND_TRIGGERED_AN_INTERRUPT_REQUEST" value="0x80"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC Multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF9"/>
          <bitfield caption="ADC Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
