Rahix/avr-device/vendor/atmega128rfa1.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="The ADC Control and Status Register A" name="ADCSRA" offset="0x7A" size="1">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="The ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="AVDD Supply Voltage OK" mask="0x80" name="AVDDOK"/>
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
          <bitfield caption="Reference Voltage OK" mask="0x20" name="REFOK"/>
          <bitfield caption="Analog Channel Change" mask="0x10" name="ACCH"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x08" name="MUX5"/>
          <bitfield caption="ADC Auto Trigger Source" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="The ADC Control and Status Register C" name="ADCSRC" offset="0x77" size="1">
          <bitfield caption="ADC Track-and-Hold Time" mask="0xC0" name="ADTHT" values="ANALOG_ADC_TRACK_AND_HOLD_TIME"/>
          <bitfield caption="Reserved" mask="0x20" name="Res0"/>
          <bitfield caption="ADC Start-up Time" mask="0x1F" name="ADSUT" values="ANALOG_ADC_STARTUP_TIME"/>
        </register>
        <register caption="Digital Input Disable Register 2" name="DIDR2" offset="0x7D" size="1">
          <bitfield caption="Reserved Bits" mask="0x80" name="ADC15D"/>
          <bitfield caption="Reserved Bits" mask="0x40" name="ADC14D"/>
          <bitfield caption="Reserved Bits" mask="0x20" name="ADC13D"/>
          <bitfield caption="Reserved Bits" mask="0x10" name="ADC12D"/>
          <bitfield caption="Reserved Bits" mask="0x08" name="ADC11D"/>
          <bitfield caption="Reserved Bits" mask="0x04" name="ADC10D"/>
          <bitfield caption="Reserved Bits" mask="0x02" name="ADC9D"/>
          <bitfield caption="Reserved Bits" mask="0x01" name="ADC8D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x80" name="ADC7D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x40" name="ADC6D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x20" name="ADC5D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x10" name="ADC4D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x08" name="ADC3D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x04" name="ADC2D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x02" name="ADC1D"/>
          <bitfield caption="Disable ADC7:0 Digital Input" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF9">
        <value caption="AREF, Internal reference voltage generation turned off" name="AREF_INTERNAL_REFERENCE_VOLTAGE_GENERATION_TURNED_OFF" value="0x00"/>
        <value caption="AVDD with external capacitor at AREF pin" name="AVDD_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x01"/>
        <value caption="Internal 1.5V Voltage Reference (no external capacitor at AREF pin)" name="INTERNAL_1_5V_VOLTAGE_REFERENCE_NO_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x02"/>
        <value caption="Internal 1.6V Voltage Reference (no external capacitor at AREF pin)" name="INTERNAL_1_6V_VOLTAGE_REFERENCE_NO_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
      <value-group name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="FREE_RUNNING_MODE" value="0x00"/>
        <value caption="Analog Comparator" name="ANALOG_COMPARATOR" value="0x01"/>
        <value caption="External Interrupt Request 0" name="EXTERNAL_INTERRUPT_REQUEST_0" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="TIMER_COUNTER0_COMPARE_MATCH_A" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="TIMER_COUNTER0_OVERFLOW" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="TIMER_COUNTER1_COMPARE_MATCH_B" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="TIMER_COUNTER1_OVERFLOW" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="TIMER_COUNTER1_CAPTURE_EVENT" value="0x07"/>
      </value-group>
      <value-group name="ANALOG_ADC_TRACK_AND_HOLD_TIME">
        <value caption="Single ended: 1, differential 3 ADC clock cycles" name="SINGLE_ENDED_1_DIFFERENTIAL_3_ADC_CLOCK_CYCLES" value="0x00"/>
        <value caption="Single ended: 2, differential 5 ADC clock cycles" name="SINGLE_ENDED_2_DIFFERENTIAL_5_ADC_CLOCK_CYCLES" value="0x01"/>
        <value caption="Single ended: 3, differential 7 ADC clock cycles" name="SINGLE_ENDED_3_DIFFERENTIAL_7_ADC_CLOCK_CYCLES" value="0x02"/>
        <value caption="Single ended: 4, differential 9 ADC clock cycles" name="SINGLE_ENDED_4_DIFFERENTIAL_9_ADC_CLOCK_CYCLES" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_STARTUP_TIME">
        <value caption="3 ADC clock cycles" name="3_ADC_CLOCK_CYCLES" value="0x00"/>
        <value caption="7 ADC clock cycles" name="7_ADC_CLOCK_CYCLES" value="0x01"/>
        <value caption="11 ADC clock cycles" name="11_ADC_CLOCK_CYCLES" value="0x02"/>
        <value caption="15 ADC clock cycles" name="15_ADC_CLOCK_CYCLES" value="0x03"/>
        <value caption="..." name="RESERVED" value="0x04"/>
        <value caption="251 ADC clock cycles" name="251_ADC_CLOCK_CYCLES" value="0x3E"/>
        <value caption="255 ADC clock cycles" name="255_ADC_CLOCK_CYCLES" value="0x3F"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write Section Read Enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
