Rahix/avr-device/vendor/atmega128rfa1.atdf
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
          <bitfield caption="Reserved" mask="0xE0" name="Res"/>
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1">
          <bitfield caption="Oscillator Calibration Tuning Value" mask="0xFF" name="CAL" values="OSCCAL_BITF"/>
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Reserved" mask="0x70" name="Res"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL_MEGARF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Reserved" mask="0xF0" name="Res"/>
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Extended Z-pointer Register for ELPM/SPM" name="RAMPZ" offset="0x5B" size="1">
          <bitfield caption="Reserved" mask="0xFC" name="Res"/>
          <bitfield caption="Extended Z-Pointer Value" mask="0x03" name="RAMPZ" values="RAMPZ_BITF"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1">
          <bitfield caption="General Purpose I/O Register 2 Value" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
          <bitfield caption="General Purpose I/O Register 1 Value" mask="0xFF" name="GPIOR" lsb="10"/>
        </register>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x80" name="GPIOR07"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x40" name="GPIOR06"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x20" name="GPIOR05"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x10" name="GPIOR04"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x08" name="GPIOR03"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x04" name="GPIOR02"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x02" name="GPIOR01"/>
          <bitfield caption="General Purpose I/O Register 0 Value" mask="0x01" name="GPIOR00"/>
        </register>
        <register caption="Power Reduction Register 2" name="PRR2" offset="0x63" size="1">
          <bitfield caption="Power Reduction SRAM3" mask="0x08" name="PRRAM3"/>
          <bitfield caption="Power Reduction SRAM2" mask="0x04" name="PRRAM2"/>
          <bitfield caption="Power Reduction SRAM1" mask="0x02" name="PRRAM1"/>
          <bitfield caption="Power Reduction SRAM0" mask="0x01" name="PRRAM0"/>
        </register>
        <register caption="Power Reduction Register 1" name="PRR1" offset="0x65" size="1">
          <bitfield caption="Power Reduction Transceiver" mask="0x40" name="PRTRX24"/>
          <bitfield caption="Power Reduction Timer/Counter5" mask="0x20" name="PRTIM5"/>
          <bitfield caption="Power Reduction Timer/Counter4" mask="0x10" name="PRTIM4"/>
          <bitfield caption="Power Reduction Timer/Counter3" mask="0x08" name="PRTIM3"/>
          <bitfield caption="Power Reduction USART1" mask="0x01" name="PRUSART1"/>
        </register>
        <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
          <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
          <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
          <bitfield caption="Power Reduction PGA" mask="0x10" name="PRPGA"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
          <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
      </register-group>
      <value-group name="OSCCAL_BITF">
        <value caption="Calibration value for lowest oscillator frequency" name="CALIBRATION_VALUE_FOR_LOWEST_OSCILLATOR_FREQUENCY" value="0x00"/>
        <value caption="End value of low frequency range calibration" name="END_VALUE_OF_LOW_FREQUENCY_RANGE_CALIBRATION" value="0x7f"/>
        <value caption="Start value of high frequency range calibration" name="START_VALUE_OF_HIGH_FREQUENCY_RANGE_CALIBRATION" value="0x80"/>
        <value caption="Calibration value for highest oscillator frequency" name="CALIBRATION_VALUE_FOR_HIGHEST_OSCILLATOR_FREQUENCY" value="0xff"/>
      </value-group>
      <value-group name="CPU_CLK_PRESCALE_4_BITS_SMALL_MEGARF">
        <value caption="Division factor 1   / RC-Oscillator   2" name="DIVISION_FACTOR_1_RC_OSCILLATOR_2" value="0x0"/>
        <value caption="Division factor 2   / RC-Oscillator   4" name="DIVISION_FACTOR_2_RC_OSCILLATOR_4" value="0x1"/>
        <value caption="Division factor 4   / RC-Oscillator   8" name="DIVISION_FACTOR_4_RC_OSCILLATOR_8" value="0x2"/>
        <value caption="Division factor 8   / RC-Oscillator  16" name="DIVISION_FACTOR_8_RC_OSCILLATOR_16" value="0x3"/>
        <value caption="Division factor 16  / RC-Oscillator  32" name="DIVISION_FACTOR_16_RC_OSCILLATOR_32" value="0x4"/>
        <value caption="Division factor 32  / RC-Oscillator  64" name="DIVISION_FACTOR_32_RC_OSCILLATOR_64" value="0x5"/>
        <value caption="Division factor 64  / RC-Oscillator 128" name="DIVISION_FACTOR_64_RC_OSCILLATOR_128" value="0x6"/>
        <value caption="Division factor 128 / RC-Oscillator 256" name="DIVISION_FACTOR_128_RC_OSCILLATOR_256" value="0x7"/>
        <value caption="Division factor 256 / RC-Oscillator 512" name="DIVISION_FACTOR_256_RC_OSCILLATOR_512" value="0x8"/>
        <value caption="Reserved" name="RESERVED" value="0x9"/>
        <value caption="Reserved" name="RESERVED" value="0xA"/>
        <value caption="Reserved" name="RESERVED" value="0xB"/>
        <value caption="Reserved" name="RESERVED" value="0xC"/>
        <value caption="Reserved" name="RESERVED" value="0xD"/>
        <value caption="Reserved" name="RESERVED" value="0xE"/>
        <value caption="Division factor 1 only permitted for RC-Oscillator. Flash and EEPROM programming is not allowed." name="DIVISION_FACTOR_1_ONLY_PERMITTED_FOR_RC_OSCILLATOR_FLASH_AND_EEPROM_PROGRAMMING_IS_NOT_ALLOWED" value="0xF"/>
      </value-group>
