Rahix/avr-device/vendor/atmega128rfa1.atdf
      <value-group name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <value-group name="RAMPZ_BITF">
        <value caption="Default value of Z-pointer MSB's." name="DEFAULT_VALUE_OF_Z_POINTER_MSB_S" value="0"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
    <module caption="FLASH Controller" name="FLASH">
      <register-group caption="FLASH Controller" name="FLASH">
        <register caption="Flash Extended-Mode Control-Register" name="NEMCR" offset="0x75" size="1">
          <bitfield caption="Enable Extended Address Mode for Extra Rows" mask="0x40" name="ENEAM"/>
          <bitfield caption="Address for Extended Address Mode of Extra Rows" mask="0x30" name="AEAM" values="NEMCR_ADDRESS_BITF"/>
        </register>
        <register caption="Reference Voltage Calibration Register" name="BGCR" offset="0x67" size="1">
          <bitfield caption="Reserved Bit" mask="0x80" name="Res"/>
          <bitfield caption="Fine Calibration Bits" mask="0x78" name="BGCAL_FINE" values="BGCAL_FINE_BITF"/>
          <bitfield caption="Coarse Calibration Bits" mask="0x07" name="BGCAL" values="BGCAL_BITF"/>
        </register>
      </register-group>
      <value-group name="NEMCR_ADDRESS_BITF">
        <value caption="Factory Row" name="FACTORY_ROW" value="0"/>
        <value caption="User Row 1" name="USER_ROW_1" value="1"/>
        <value caption="User Row 2" name="USER_ROW_2" value="2"/>
        <value caption="User Row 3" name="USER_ROW_3" value="3"/>
      </value-group>
      <value-group name="BGCAL_FINE_BITF">
        <value caption="Center value" name="CENTER_VALUE" value="0"/>
        <value caption="Voltage step up" name="VOLTAGE_STEP_UP" value="1"/>
        <value caption="Voltage step down" name="VOLTAGE_STEP_DOWN" value="8"/>
        <value caption="Setting for highest voltage" name="SETTING_FOR_HIGHEST_VOLTAGE" value="7"/>
        <value caption="Setting for lowest voltage" name="SETTING_FOR_LOWEST_VOLTAGE" value="15"/>
      </value-group>
      <value-group name="BGCAL_BITF">
        <value caption="Center value" name="CENTER_VALUE" value="4"/>
        <value caption="Voltage step up" name="VOLTAGE_STEP_UP" value="3"/>
        <value caption="Voltage step down" name="VOLTAGE_STEP_DOWN" value="5"/>
        <value caption="Setting for highest voltage" name="SETTING_FOR_HIGHEST_VOLTAGE" value="0"/>
        <value caption="Setting for lowest voltage" name="SETTING_FOR_LOWEST_VOLTAGE" value="7"/>
      </value-group>
    </module>
    <module caption="Power Controller" name="PWRCTRL">
      <register-group caption="Power Controller" name="PWRCTRL">
        <register caption="Transceiver Pin Register" name="TRXPR" offset="0x139" size="1">
          <bitfield caption="Reserved" mask="0xF0" name="Res"/>
          <bitfield caption="Multi-purpose Transceiver Control Bit" mask="0x02" name="SLPTR"/>
          <bitfield caption="Force Transceiver Reset" mask="0x01" name="TRXRST"/>
        </register>
        <register caption="Data Retention Configuration Register of SRAM 0" name="DRTRAM0" offset="0x135" size="1">
          <bitfield caption="Reserved" mask="0xC0" name="Res"/>
          <bitfield caption="DRT Switch OK" mask="0x20" name="DRTSWOK"/>
          <bitfield caption="Enable SRAM Data Retention" mask="0x10" name="ENDRT"/>
        </register>
        <register caption="Data Retention Configuration Register of SRAM 1" name="DRTRAM1" offset="0x134" size="1">
          <bitfield caption="Reserved" mask="0xC0" name="Res"/>
          <bitfield caption="DRT Switch OK" mask="0x20" name="DRTSWOK"/>
          <bitfield caption="Enable SRAM Data Retention" mask="0x10" name="ENDRT"/>
        </register>
        <register caption="Data Retention Configuration Register of SRAM 2" name="DRTRAM2" offset="0x133" size="1">
          <bitfield caption="Reserved Bit" mask="0x40" name="Res"/>
          <bitfield caption="DRT Switch OK" mask="0x20" name="DRTSWOK"/>
          <bitfield caption="Enable SRAM Data Retention" mask="0x10" name="ENDRT"/>
        </register>
        <register caption="Data Retention Configuration Register of SRAM 3" name="DRTRAM3" offset="0x132" size="1">
          <bitfield caption="Reserved" mask="0xC0" name="Res"/>
          <bitfield caption="DRT Switch OK" mask="0x20" name="DRTSWOK"/>
          <bitfield caption="Enable SRAM Data Retention" mask="0x10" name="ENDRT"/>
        </register>
        <register caption="Low Leakage Voltage Regulator Data Register (Low-Byte)" name="LLDRL" offset="0x130" size="1">
          <bitfield caption="Reserved" mask="0xF0" name="Res"/>
          <bitfield caption="Low-Byte Data Register Bits" mask="0x0F" name="LLDRL" values="LLDRL_VALUE_BITF"/>
        </register>
        <register caption="Low Leakage Voltage Regulator Data Register (High-Byte)" name="LLDRH" offset="0x131" size="1">
          <bitfield caption="Reserved" mask="0xE0" name="Res"/>
          <bitfield caption="High-Byte Data Register Bits" mask="0x1F" name="LLDRH" values="LLDRH_VALUE_BITF"/>
        </register>
        <register caption="Low Leakage Voltage Regulator Control Register" name="LLCR" offset="0x12F" size="1">
          <bitfield caption="Reserved Bit" mask="0xC0" name="Res"/>
          <bitfield caption="Calibration Done" mask="0x20" name="LLDONE"/>
          <bitfield caption="Comparator Output" mask="0x10" name="LLCOMP"/>
          <bitfield caption="Calibration Active" mask="0x08" name="LLCAL"/>
          <bitfield caption="Temperature Coefficient of Current Source" mask="0x04" name="LLTCO"/>
          <bitfield caption="Short Lower Calibration Circuit" mask="0x02" name="LLSHORT"/>
          <bitfield caption="Enable Automatic Calibration" mask="0x01" name="LLENCAL"/>
        </register>
        <register caption="Port Driver Strength Register 0" name="DPDS0" offset="0x136" size="1">
          <bitfield caption="Driver Strength Port F" mask="0xC0" name="PFDRV" values="PAD_IO_bitf"/>
          <bitfield caption="Driver Strength Port E" mask="0x30" name="PEDRV" values="PAD_IO_bitf"/>
          <bitfield caption="Driver Strength Port D" mask="0x0C" name="PDDRV" values="PAD_IO_bitf"/>
          <bitfield caption="Driver Strength Port B" mask="0x03" name="PBDRV" values="PAD_IO_bitf"/>
        </register>
        <register caption="Port Driver Strength Register 1" name="DPDS1" offset="0x137" size="1">
          <bitfield caption="Reserved" mask="0xFC" name="Res"/>
          <bitfield caption="Driver Strength Port G" mask="0x03" name="PGDRV" values="PAD_IO_bitf"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
        </register>
      </register-group>
      <value-group name="LLDRL_VALUE_BITF">
        <value caption="Calibration limit for fast process corner/high output voltage" name="CALIBRATION_LIMIT_FOR_FAST_PROCESS_CORNER_HIGH_OUTPUT_VOLTAGE" value="0x00"/>
        <value caption="Calibration limit for slow process corner/low output voltage" name="CALIBRATION_LIMIT_FOR_SLOW_PROCESS_CORNER_LOW_OUTPUT_VOLTAGE" value="0x08"/>
      </value-group>
      <value-group name="LLDRH_VALUE_BITF">
        <value caption="Calibration limit for fast process corner/high output voltage" name="CALIBRATION_LIMIT_FOR_FAST_PROCESS_CORNER_HIGH_OUTPUT_VOLTAGE" value="0x00"/>
        <value caption="Calibration limit for slow process corner/low output voltage" name="CALIBRATION_LIMIT_FOR_SLOW_PROCESS_CORNER_LOW_OUTPUT_VOLTAGE" value="0x10"/>
      </value-group>
      <value-group name="PAD_IO_bitf">
        <value caption="2 mA" name="PAD_IO_2MA" value="0"/>
        <value caption="4 mA" name="PAD_IO_4MA" value="1"/>
        <value caption="6 mA" name="PAD_IO_6MA" value="2"/>
        <value caption="8 mA" name="PAD_IO_8MA" value="3"/>
      </value-group>
    </module>
  </modules>
</avr-tools-device-file>
